/*공통 함수*/

// 이메일 input에서 focus out 할 때, 값이 없을 경우 input에 빨강색 테두리와 아래에 “이메일을 입력해주세요.” 빨강색 에러 메세지를 보입니다.
// 이메일 input에서 focus out 할 때, 이메일 형식에 맞지 않는 경우 input에 빨강색 테두리와 아래에 “잘못된 이메일 형식입니다” 빨강색 에러 메세지를 보입니다.

//이메일 관련 함수 작성, 이메일 input에서 focusout 될때 핸들러 작동

// 비밀번호 input에서 focus out 할 때, 값이 없을 경우 아래에 “비밀번호를 입력해주세요.” 에러 메세지를 보입니다
// 비밀번호 input에서 focus out 할 때, 값이 8자 미만일 경우 아래에 “비밀번호를 8자 이상 입력해주세요.” 에러 메세지를 보입니다.

// input 에 빈 값이 있거나 에러 메세지가 있으면  ‘로그인,회원가입’ 버튼은 비활성화 됩니다.
// Input 에 유효한 값을 입력하면  ‘로그인,회원가입' 버튼이 활성화 됩니다.

//로그인 버튼 함수 작성, 로그인 버튼 요소에 핸들러 등록,
//로그인 버튼 함수 (위의 input 요소에 에러메시지가 없고, 유효한 값일때 로그인 버튼 활성화 되게 )
// 활성화된 ‘로그인,회원가입’ 버튼을 누르면  “/items”,signin 로 이동

/*signup 함수 */
// 닉네임 input에서 focus out 할 때, 값이 없을 경우 input에 빨강색 테두리와 아래에 “닉네임을 입력해주세요.” 빨강색 에러 메세지를 보입니다.

//닉네임  관련 함수 작성, 닉네임 input에서 focusout 될때 (값이 없을경우) 핸들러 작동

// 비밀번호 input과 비밀번호 확인 input의 값이 다른 경우, 비밀번호 확인 input 아래에 “비밀번호가 일치하지 않습니다..” 에러 메세지를 보입니다.
